/**
 * 系统错误码定义  [10000 - 19999]
 */
export default {
  10000: '参数校验异常',
  10001: '系统用户已存在',
  10002: '填写验证码有误',
  10003: '用户名密码有误',
  10004: '节点路由已存在',
  10005: '权限必须包含父节点',
  10006: '非法操作：该节点仅支持目录类型父节点',
  10007: '非法操作：节点类型无法直接转换',
  10008: '该角色存在关联用户，请先删除关联用户',
  10009: '该部门存在关联用户，请先删除关联用户',
  10010: '该部门存在关联角色，请先删除关联角色',
  10015: '该部门存在子部门，请先删除子部门',
  10011: '旧密码与原密码不一致',
  10012: '如想下线自身可右上角退出',
  10013: '不允许下线该用户',
  10014: '父级菜单不存在',
  10016: '系统内置功能，不可删除',
  10017: '新增管理员账户有误或账户已存在',

  10018: '频道分配组织数量超限',
  10019: '组织用户数量超限',
  10020: '新增组织数量超限',

  10021: '缺少APP信息或组织信息',
  10022: '新增管理员账户已存在',
  10025: '搜索用户过快，请勿频繁搜索',
  10031: 'APP别名已存在',
  10032: '组织别名已存在',

  // token相关
  11001: '登录无效或无权限访问',
  11002: '登录身份已过期',
  11003: '无权限，请联系管理员申请权限',

  // OSS相关
  20001: '当前创建的文件或目录已存在',

  10051: '复制失败',
  20011: '复制成功'
}
